---
kind: method
id: M:Autodesk.Revit.DB.HostedSweep.VerticalFlip
source: html/481bf9a1-1437-9da7-0589-35d7bb9d7428.htm
---
# Autodesk.Revit.DB.HostedSweep.VerticalFlip Method

Flip the hosted sweep object along vertical line.

## Syntax (C#)
```csharp
public void VerticalFlip()
```